<?php 
$name = test_input($_POST["name"]);

 
  function test_input($data) {
    $data = trim($data);
    $data = stripslashes($data);
    $data = htmlspecialchars($data);
    return $data;
  }

  $arr = array( "a"=>"அவர்கள் போன ஜென்மத்தில் குரங்காக இருந்தார் ,பிடுங்கி தின்பதை வாடிக்கையாக கொண்டிருந்தார்", 
          "b"=>"அவர்கள் போன ஜென்மத்தில் கழுதையாக இருந்தார் ,மூட்டை தூக்குவதில் வல்லவர்", 
          "c"=>"அவர்கள் போன ஜென்மத்தில் சிங்கமாக இருந்தார் ,ஆனால் காட்டுக்கு ராஜா இல்லை", 
          "d"=>"அவருக்கு போன ஜென்மமே இல்லை",
          "e"=>"அவர்கள் போன ஜென்மத்தில் பன்றியாக இருந்தார் ,அனைத்தையும் உண்ணும் குணம் கொண்டிருந்தார்",
          "f"=>"அவர்கள் போன ஜென்மத்தில் பூனையாக இருந்தார் ,அதி புத்திசாலித்தனம் கொண்டிருந்தார்",
          "g"=>"அவர்கள் போன ஜென்மத்தில் நாயாக இருந்தார் ,நன்றி விசுவாசம் கொண்டிருந்தார்",
          "h"=>"அவர்கள் போன ஜென்மத்தில் யானையாக இருந்தார் ,அதிகம் உண்ணும் பழக்கம் கொண்டிருந்தார்",
          "i"=>"அவர்கள் போன ஜென்மத்தில் பச்சோந்தியாக இருந்தார் ,இடத்திற்கு  தகுந்தார் போல் மாறிக்கொள்வார்",
          "j"=>"அவர்கள் போன ஜென்மத்தில் எறும்பாக இருந்தார் ,சுறுசுறுப்புக் கொண்டவர்",
          "k"=>"அவர்கள் போன ஜென்மத்தில் நரியாக  இருந்தார் ,திருட்டத்தனம்  கொண்டிருந்தார்",
          "l"=>"அவர்கள் போன ஜென்மத்தில் எருமையாக இருந்தார் ,எந்த வேலையும் செய்யாத சோம்பேறியாக இருந்தார்",
          "m"=>"அவர்கள் போன ஜென்மத்தில் ஆமையாக  இருந்தார் , வீட்டை விட்டு வெளியே வரமாட்டார்",
          "n"=>"அவர்கள் போன ஜென்மத்தில் காகமாகா இருந்தார் ,பொருக்கித் திண்ணும் ண்ணும் குணம் கொண்டிருந்தார்",
          "o"=>"அவர்கள் போன ஜென்மத்தில் சிலந்தியாக  இருந்தார் ,விடாமுயற்சி குணத்தை கொண்டிருந்தார் ",
          "p"=>"அவர்கள் போன ஜென்மத்தில் தவளையாக இருந்தார் ,காட்டிக்கொடுக்கும்  குணத்தை கொண்டிருந்தார் ",
          "q"=>"அவர்கள் போன ஜென்மத்தில் புழுவாக  இருந்தார் ,பாவப்பட்ட உயிரினமாக இருந்து வந்தார் ",
          "r"=>"அவர்கள் போன ஜென்மத்தில் ஆடாக  இருந்தார் ,பயந்தாங்கோலியாக  இருந்து வந்தார்",
          "s"=>"அவர்கள் போன ஜென்மத்தில் கழுகாக  இருந்தார் ,இவர் பார்வையில் யாரும்  தப்பியதில்லை",
          "t"=>"அவர்கள் போன ஜென்மத்தில் நத்தையாக இருந்தார் ,இவருக்கு சுத்தம் என்பதே கிடையாது ",
          "u"=>"அவர்கள் போன ஜென்மத்தில் கோழியாக இருந்தார் ,வீணாக பேசுவதுதான் இவர் வேலை",
          "v"=>"அவர்கள் போன ஜென்மத்தில் முயலாக  இருந்தார் ,நல்ல குணம் கொண்டவராக இருந்தார் ",
          "w"=>"அவர்கள் போன ஜென்மத்தில் கரடியாக  இருந்தார் ,பலசாலியாக  வாழ்ந்து வந்தார் ",
          "x"=>"அவர்கள் போன ஜென்மத்தில் புலியாக  இருந்தார் ,பொறுமை கொண்டு காரியம் செய்யபவராக வாழ்ந்தார்",
          "y"=>"அவர்கள் போன ஜென்மத்தில் கிளியாக இருந்தார் ,சுய சிந்தனை இல்லாதவராக இருந்தார் ",
          "z"=>"அவர்கள் போன ஜென்மத்தில் எலியாக இருந்தார் ,அனைவரையும் தொந்தரவு செய்வதையே வேலையாக கொண்டவர் ",




        );
  shuffle($arr);


  $cookie_value = $arr[0];
  $cookie_name = test_input($_POST["name"]);

  setcookie("value",$cookie_value);
  setcookie("name",$cookie_name);

  header("location:result.php");

?>

